RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_ir.c
    if (direct == IR_TX || direct == IR_TXRX) {
        /* Enable ir tx unit */
        tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);
        BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRTX_EN));
    }

    if (direct == IR_RX || direct == IR_TXRX) {
        /* Enable ir rx unit */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
        BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR disable function
 *
 * @param  direct: IR direction type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_Disable(IR_Direction_Type direct)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_DIRECTION_TYPE(direct));

    if (direct == IR_TX || direct == IR_TXRX) {
        /* Disable ir tx unit */
        tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);
        BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRTX_EN));
    }

    if (direct == IR_RX || direct == IR_TXRX) {
        /* Disable ir rx unit */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
        BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR tx software mode enable or disable function
 *
 * @param  txSWM: Enable or disable
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_TxSWM(BL_Fun_Type txSWM)
{
    uint32_t tmpVal;

    /* Enable or disable tx swm */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);

    if (ENABLE == txSWM) {
        BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRTX_SWM_EN));
    } else {
        BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRTX_SWM_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR clear rx fifo function
 *
 * @param  None
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_RxFifoClear(void)
{
    uint32_t tmpVal;

    /* Clear rx fifo */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_FIFO_CONFIG_0);
    BL_WR_REG(IR_BASE, IRTX_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, IR_RX_FIFO_CLR));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR clear tx fifo function
 *
 * @param  None
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_TxFifoClear(void)
{
    uint32_t tmpVal;

    /* Clear rx fifo */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_FIFO_CONFIG_0);
    BL_WR_REG(IR_BASE, IRTX_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, IR_TX_FIFO_CLR));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send data function
 *
 * @param  data: data to send
 * @param  length: Length of send buffer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SendData(uint32_t *data, uint8_t length)
{
    uint32_t txLen = 0;
    uint32_t timeoutCnt = IR_TX_INT_TIMEOUT_COUNT;

    while (txLen < length) {
        if (IR_GetTxFifoCount() > 0) {
            BL_WR_REG(IR_BASE, IR_FIFO_WDATA, data[txLen++]);
            timeoutCnt = IR_TX_INT_TIMEOUT_COUNT;
        } else {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR software mode send pulse width data function
 *
 * @param  data: data to send
 * @param  length: Length of send buffer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SWMSendData(uint16_t *data, uint8_t length)
{
    uint8_t i = 0, j = 0;
    uint16_t minData = data[0];
    uint32_t tmpVal;
    uint32_t count = (length + 3) / 4;
    uint32_t pwVal = 0;

    /* Search for min value */
    for (i = 1; i < length; i++) {
        if (minData > data[i] && data[i] != 0) {
            minData = data[i];
        }
    }

    /* Set min value as pulse width unit */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_PULSE_WIDTH);
    BL_WR_REG(IR_BASE, IRTX_PULSE_WIDTH, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRTX_PW_UNIT, minData));

    /* Calculate tx SWM pulse width data as multiples of pulse width unit */
    for (i = 0; i < count; i++) {
        pwVal = 0;

        if (i < count - 1) {
            /* Put every four pulse width together as a 32-bit value to tx fifo */
            for (j = 0; j < 4; j++) {
                /* Every pulse width divided by pulse width unit */
                tmpVal = (DIVIDE_ROUND(data[j + i * 4], minData) - 1) & 0xff;
                /* Tx fifo 32-bit value: pwVal[7:0]:first pulse width, pwVal[15:8]:second pulse width... */
                pwVal |= tmpVal << (8 * j);
            }
        } else {
            /* Deal with pulse width data remained which is less than 4 */
            for (j = 0; j < length % 4; j++) {
                tmpVal = (DIVIDE_ROUND(data[j + i * 4], minData) - 1) & 0xff;
                pwVal |= tmpVal << (8 * j);
            }
        }

        /* Write to tx fifo */
        IR_SendData(&pwVal, 1);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send command function
 *
 * @param  data: data to send
 * @param  length: Length of send buffer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SendCommand(uint32_t *data, uint8_t length)
{
    uint32_t timeoutCnt = IR_TX_INT_TIMEOUT_COUNT;

    /* Write data */
    IR_SendData(data, length);

